vvpai9/Keil/Keil_v5/ARM/INC/ADI/ADuC7124.h
#define          PWMCON0                                    (*(volatile unsigned long      *) 0xFFFF0F80)
#define          PWM0COM0                                   (*(volatile unsigned long      *) 0xFFFF0F84)
#define          PWM0COM1                                   (*(volatile unsigned long      *) 0xFFFF0F88)
#define          PWM0COM2                                   (*(volatile unsigned long      *) 0xFFFF0F8C)
#define          PWM0LEN                                    (*(volatile unsigned long      *) 0xFFFF0F90)
#define          PWM1COM0                                   (*(volatile unsigned long      *) 0xFFFF0F94)
#define          PWM1COM1                                   (*(volatile unsigned long      *) 0xFFFF0F98)
#define          PWM1COM2                                   (*(volatile unsigned long      *) 0xFFFF0F9C)
#define          PWM1LEN                                    (*(volatile unsigned long      *) 0xFFFF0FA0)
#define          PWM2COM0                                   (*(volatile unsigned long      *) 0xFFFF0FA4)
#define          PWM2COM1                                   (*(volatile unsigned long      *) 0xFFFF0FA8)
#define          PWM2COM2                                   (*(volatile unsigned long      *) 0xFFFF0FAC)
#define          PWM2LEN                                    (*(volatile unsigned long      *) 0xFFFF0FB0)
#define          PWMCON1                                    (*(volatile unsigned long      *) 0xFFFF0FB4)
#define          PWMCLRI                                    (*(volatile unsigned long      *) 0xFFFF0FB8)

// EXTERNAL MEMORY REGISTERS

#define          XMCFG                                      (*(volatile unsigned long      *) 0xFFFFF000)
#define          XM0CON                                     (*(volatile unsigned long      *) 0xFFFFF010)
#define          XM1CON                                     (*(volatile unsigned long      *) 0xFFFFF014)
#define          XM2CON                                     (*(volatile unsigned long      *) 0xFFFFF018)
#define          XM3CON                                     (*(volatile unsigned long      *) 0xFFFFF01C)
#define          XM0PAR                                     (*(volatile unsigned long      *) 0xFFFFF020)
#define          XM1PAR                                     (*(volatile unsigned long      *) 0xFFFFF024)
#define          XM2PAR                                     (*(volatile unsigned long      *) 0xFFFFF028)
#define          XM3PAR                                     (*(volatile unsigned long      *) 0xFFFFF02C)

// GPIO AND SERIAL PORT MUX

#define          GP0CON                                     (*(volatile unsigned long      *) 0xFFFFF400)
#define          GP1CON                                     (*(volatile unsigned long      *) 0xFFFFF404)
#define          GP2CON                                     (*(volatile unsigned long      *) 0xFFFFF408)
#define          GP3CON                                     (*(volatile unsigned long      *) 0xFFFFF40C)
#define          GP4CON                                     (*(volatile unsigned long      *) 0xFFFFF410)
#define          GP0DAT                                     (*(volatile unsigned long      *) 0xFFFFF420)
#define          GP0SET                                     (*(volatile unsigned long      *) 0xFFFFF424)
#define          GP0CLR                                     (*(volatile unsigned long      *) 0xFFFFF428)
#define          GP0PAR                                     (*(volatile unsigned long      *) 0xFFFFF42C)
#define          GP1DAT                                     (*(volatile unsigned long      *) 0xFFFFF430)
#define          GP1SET                                     (*(volatile unsigned long      *) 0xFFFFF434)
#define          GP1CLR                                     (*(volatile unsigned long      *) 0xFFFFF438)
#define          GP1PAR                                     (*(volatile unsigned long      *) 0xFFFFF43C)
#define          GP2DAT                                     (*(volatile unsigned long      *) 0xFFFFF440)
#define          GP2SET                                     (*(volatile unsigned long      *) 0xFFFFF444)
#define          GP2CLR                                     (*(volatile unsigned long      *) 0xFFFFF448)
#define          GP2PAR                                     (*(volatile unsigned long      *) 0xFFFFF44C)
#define          GP3DAT                                     (*(volatile unsigned long      *) 0xFFFFF450)
#define          GP3SET                                     (*(volatile unsigned long      *) 0xFFFFF454)
#define          GP3CLR                                     (*(volatile unsigned long      *) 0xFFFFF458)
#define          GP3PAR                                     (*(volatile unsigned long      *) 0xFFFFF45C)
#define          GP4DAT                                     (*(volatile unsigned long      *) 0xFFFFF460)
#define          GP4SET                                     (*(volatile unsigned long      *) 0xFFFFF464)
#define          GP4CLR                                     (*(volatile unsigned long      *) 0xFFFFF468)
#define          GP4PAR                                     (*(volatile unsigned long      *) 0xFFFFF46C)

// FLASH CONTROL INTERFACE

#define          FEE0STA                                    (*(volatile unsigned long      *) 0xFFFFF800)
#define          FEE0MOD                                    (*(volatile unsigned long      *) 0xFFFFF804)
#define          FEE0CON                                    (*(volatile unsigned long      *) 0xFFFFF808)
#define          FEE0DAT                                    (*(volatile unsigned long      *) 0xFFFFF80C)
#define          FEE0ADR                                    (*(volatile unsigned long      *) 0xFFFFF810)
#define          FEE0SGN                                    (*(volatile unsigned long      *) 0xFFFFF818)
#define          FEE0PRO                                    (*(volatile unsigned long      *) 0xFFFFF81C)
#define          FEE0HID                                    (*(volatile unsigned long      *) 0xFFFFF820)

// FLASH CONTROL INTERFACE

#define          FEE1STA                                    (*(volatile unsigned long      *) 0xFFFFF880)
#define          FEE1MOD                                    (*(volatile unsigned long      *) 0xFFFFF884)
#define          FEE1CON                                    (*(volatile unsigned long      *) 0xFFFFF888)
#define          FEE1DAT                                    (*(volatile unsigned long      *) 0xFFFFF88C)
#define          FEE1ADR                                    (*(volatile unsigned long      *) 0xFFFFF890)
#define          FEE1SGN                                    (*(volatile unsigned long      *) 0xFFFFF898)
#define          FEE1PRO                                    (*(volatile unsigned long      *) 0xFFFFF89C)
#define          FEE1HID                                    (*(volatile unsigned long      *) 0xFFFFF8A0)
/*    Function Pointers for Interrupts  */
typedef void (* tyVctHndlr) (void);

extern tyVctHndlr    IRQ;
extern tyVctHndlr    SWI;
extern tyVctHndlr    FIQ;
extern tyVctHndlr    UNDEF;
extern tyVctHndlr    PABORT;
extern tyVctHndlr    DABORT;
